{"texts": {
	"menu": [
		{"text": {
			"en":"Home",
			"es":"Inicio",
			"link": "/"
			}
		},
		{"text": {
			"en":"About",
			"es":"Acerca",
			"link": "#/about"
			}
		},
		{"text": {
			"en":"Contact me!",
			"es":"Contacto",
			"link": "#/contact"
			}
		}
	],
	"postfixNumbers": {
		"en": ["st","nd","rd","th"],
		"es": ["ª","ª","ª","ª"]
		},
	"Home": {
		"title": {
			"en":"Welcome to Mahjong Learn!",
			"es":"Bienvenido a Mahjong Learn!"
		},		
		"questions": [
			{"text": {
				"en": "Have you always wanted to someone to tell you what was this stuff about?",
				"es": "¿Deseaste alguna vez que alguien te contara de qué se trata esto?"
				}
			},
			{"text": {
				"en": "Mahjong... Is it like Chinese cards?",
				"es": "Mahjong... ¿Es una clase de cartas chinas?"
				}
			},
			{"text": {
				"en": "Do you want to learn to play Mahjong?",
				"es": "¿Quieres aprender a jugar Mahjong?"
				}
			},
			{"text": {
				"en": "Do you have friends interested in playing Mahjong but you don't have the time to teach them?",
				"es": "¿Tienes amigos interesados en jugar Mahjong pero no tienes el tiempo de enseñarles?"
				}
			}
		],
		"beforeLegend": {
			"en": "If you can answer \"Yes\" to any of this questions...",
			"es": "Si puedes responder \"Sí\" a cualquiera de estas preguntas..."
			},
		"legend": {
			"en": "I hope this site suits you!",
			"es": "¿Espero que este sitio sea para ti!"
			},
		"continue": {
			"en": "Continue",
			"es": "Continuar",
			"link": "#/welcome"
			}
		},
	"Welcome": {
		"title": {
				"en":"Welcome (again) to Mahjong Learn!",
				"es":"Bienvenido (de nuevo) a Mahjong Learn!"
			},
		"continue": {
			"en": "Continue",
			"es": "Continuar",
			"link": "#/table"
			},		
		"legendTexts": [
			{"text": {
				"en": "Welcome to our practical web tutorial for learning the antique art of strategy and random chance of Mahjong. We intend that in the following pages you could play a full round and teach you how to form different combinations to beat over your friends!",
				"es": "Bienvenido a nuestro tutorial web práctico para aprender el antiguo arte de estrategia y azar del Mahjong. Nuestra intención es que en las siguientes páginas puedas jugar una ronda completa y enseñarte como formar diferentes combinaciones para derrotar a tus amigos!",
				"decoration": ""
				}
			},
			{"text": {
				"en": "We will focus in the ruling of the Japanese Riichi Mahjong",
				"es": "Nos vamos a centrar en las reglas del Mahjong japonés Riichi",
				"decoration": ""
				}
			}],
		"historyTexts": [
			{"text": {
				"en": "Mahjong, a game that originated in China, is commonly played by four players (with some three-player variations found in Korea and Japan). The game and its regional variants are widely played throughout Eastern and South Eastern Asia and have a small following in Western countries. Similar to the Western card game rummy, mahjong is a game of skill, strategy, and calculation and involves a degree of chance. ",
				"es": "El mahjong, mah jong o mah-jongg, es un juego de mesa de origen chino, exportado al resto del mundo, y particularmente a Occidente, a partir de 1920. En chino también se le conoce como gorrión. El juego guarda cierta similitud con el Rummy, ya que su objetivo es formar grupos de fichas, como escaleras de números consecutivos de un mismo palo o bien tres o cuatro fichas iguales. Aunque las reglas para jugar son casi siempre las mismas, existen diferentes variantes. La principal diferencia entre ellas radica en qué jugadas puntúan y cuál su valor. ",
				"decoration": ""
				}
			},
			{"text": {
				"en": "The game is played with a set of 144 tiles based on Chinese characters and symbols, although some regional variations use a different number of tiles. In most variations, each player begins by receiving 13 tiles. In turn players draw and discard tiles until they complete a legal hand using the 14th drawn tile to form four groups (melds) and a pair (head). There are fairly standard rules about how a piece is drawn, stolen from another player and thus melded, the use of simples (numbered tiles) and honours (winds and dragons), the kinds of melds, and the order of dealing and play. However there are many regional variations in the rules; in addition, the scoring system and the minimum hand necessary to win varies significantly based on the local rules being used.",
				"es": "Su antecesor recibía el nombre de «juego de hojas en tiras», ya que las fichas eran de cartulina, como los naipes actuales. Progresivamente se abandonó este material y se empezaron a fabricar fichas de marfil, madera y, sobre todo, bambú, aunque actualmente lo normal es utilizar el plástico, más duradero y barato. No obstante, se siguen fabricando, como se hizo en la antigüedad, verdaderas obras de arte en distintos materiales.",
				"decoration": "images/origin.png"
				}
			}]
		},
	"Table": {
		"titlePlayers": {
			"en": "Players",
			"es": "Jugadores"
			},
		"playersLegend": {
			"en": "This rule set works for 4 players",
			"es": "Estas reglas son adecuadas para 4 jugadores."
			},
		"titleTable": {
				"en":"The game table",
				"es":"La mesa de juego"
			},
		"continue": {
			"en": "Continue",
			"es": "Continuar",
			"link": "#/tiles"
			},
		"equipmentTitle": {
			"en": "Equipment",
			"es": "Equipamiento y materiales"
			},
		"equipment": [
			{"text": {
				"en": "First of all, you will need a specific mahjong tile set (though cards can be used).",
				"es": "Primero, necesitarás un juego específico de fichas de mahjong (cartas pueden ser utilizadas).",
				"decoration": "images/tiles-dropped.jpg"
				}
			},
			{"text": {
				"en": "It's not mandatory (although it would be great) to have tile racks for each player, to set the tiles as you want to.",
				"es": "Es opcional (aunque sería genial) tener atriles para las fichas de cada jugador, para poder ubicarlas cómodamente.",
				"decoration": "images/tiles-racks.jpg"
				}
			},
			{"text": {
				"en": "A square or round table, like the one we have in the background.",
				"es": "Una mesa redonda o cuadrada, como la que tenemos al fondo.",
				"decoration": ""
				}
			},
			{"text": {
				"en": "Dice.",
				"es": "Dos dados.",
				"decoration": "images/tables-dice.jpg"
				}
			},
			{"text": {
				"en": "Any kind of counters to keep track of the score.",
				"es": "Cualquier tipo de ficha para llevar los puntajes.",
				"decoration": "images/counters.jpg"
				}
			},
			{"text": {
				"en": "Indicators or markers for showing who is dealer and which round is being played. The rounds (and seats) are names after four honours called winds. The order of the winds are East, South, West and North. ",
				"es": "Indicadores o marcadores para mostrar quien reparte y qué ronda se está jugando. Las rondas (y asientos) son denominadas con cuatro honores llamados vientos. El orden de los vientos es Este, Sur, Oeste y Norte.",
				"decoration": "images/round-winds.png"
				}
			}]
		},
	"Tiles": {
		"title": {
			"en":"The tiles",
			"es":"Las fichas"
			},
		"continue": {
			"en": "Continue",
			"es": "Continuar",
			"link": "#/start"
			},
		"suitsDescription": {
			"en": "The set of mahjong tiles consist of 136 pieces.. There are three different suits numbered from 1 to 9, which are called simple tiles.. They are: ",
			"es": "El juego de fichas de mahjong consiste de 136 piezas.. Hay tres diferentes palos numerados de 1 a 9, los cuales son llamados fichas simples.. Ellos son: "
			},
		"suitsAdditional": {
			"en": "There are 4 tiles for each one, which gives the current total of 108 tiles so far.. The ones and the nines of each suit are called Terminals.. ",
			"es": "Existen 4 piezas por cada una, lo que da un total de 108 fichas hasta ahora.. Los unos y los nueves de cada palo son llamados terminales..  "
			},
		"honorsDescription": {
			"en": "Also, there are two different honor suits, which act as bonus tiles in the game: the dragons and the winds.. There are three Dragons: Red, Green and White (in this order) and four Winds: East, South, West and North (in this order).. ",
			"es": "Además, existen dos tipos diferentes de honores que actúan y puntúan especialmente en el juego: los dragones y los vientos.. Existen tres dragones: Rojo, Verde y Blanco (en este orden) y cuatro vientos: Este, Sur, Oeste y Norte (en este orden).. "
			},
		"honorsAdditional": {
			"en": "In the same way with simple tiles, there are 4 tiles for each honor.. So, the grand total are 136 mahjong tiles..  ",
			"es": "De la misma manera que con las piezas simples, hay 4 piezas de cada honor.. Entonces, el total son 136 fichas de mahjong.. "
			},
		"preparationAdditional": {
			"en": "In the next page we will show you how to prepare your game table.. Hit Continue!",
			"es": "En la siguiente pantalla te mostraremos como preparar tu mesa de juego.. Clickea en Continuar!"
			}
		},
	"Start": {
		"title": {
			"en":"Starting the game",
			"es":"Iniciando el juego"
			},
		"continue": {
			"en": "Continue",
			"es": "Continuar",
			"link": "#/yaku"
			},
		"titlePreparation": {
			"en": "Preparation",
			"es": "Preparación"
			},
		"preparationDescription": {
			"en": "First of all, you must turn back your tiles and shuffle them pretty well.. After you''ve shuffled the tiles you must form a \"wall\" consisting of a lineal arrangement of 17 tiles width and 2 tiles height, each one placed in front of every seat.. ",
			"es": "Primero, debes voltear tus fichas boca abajo y mezclarlas muy bien.. Luego de mezclarlas, debes formar un \"muro\" agrupando linealmente las fichas de 17 de ancho y 2 de alto, cada grupo ubicado frente a cada asiento.. "
		  },
	  "diceDescription": {
			"en": "Then, all the players roll dice to establish the order of the round winds (and also who is the dealer).. The best dice roll gets assigned the East wind and draws the tiles... ",
			"es": "Luego, todos los jugadores tiran dados para establecer el order de los vientos de ronda (así como también quien reparte).. La mejor tirada de dados es asignada con el viento Este y reparte las piezas.. "
		  },
	  "yourSeat": {
			"en": "Your seat",
			"es": "Tu asiento"
		  },
		"windsOrder": {
		    "east": {"en": "East", "es": "Este"},
		    "south": {"en": "South", "es": "Sur"},
		    "west": {"en": "West", "es": "Oeste"},
		    "north": {"en": "North", "es": "Norte"}
		 	},
		"orderLabel": {
			 "en": "Order", "es": "Orden"
		  },
	  "drawOrderDescription": {
			"en": "After the round order was set, the dealer roll dice again to select which tile set to draw to the players.. Afterwards, count the round walls following the established order to select the starting point.. ",
			"es": "Luego que el orden de la ronda es determinado, el repartidor tira otro par de dados para seleccionar qué juego de piezas repartir a los jugadores.. Posteriormente, cuenta los muros de cada ronda siguiendo el orden establecido para seleccionar el punto de partida.. "
		  },
	  "drawAfterDiceDescription": {
			"en": "Draw 6 pairs each to the players in the round sequence, and to complete the hand give the East player the upper tile of the first and the third following pairs and the 3 remaining pieces to the other players.. ",
			"es": "Reparte 6 pares a cada jugador en la secuencia de la ronda, y para completar la mano, le da al jugador Este la pieza superior del primer y tercer par siguiente, y las 3 piezas restantes a los otros jugadores.. "
		  },
		"currentDrawOrder": {
			"first": {
				"en": "In this case, the dice roll was ",
				"es": "En este caso, la tirada de dados fue "
				},
			"second": {
				"en": ", count from the East seat and then we start the draw from the wall located in front of the seat ",
				"es": ", contamos desde el asiento Este, y empezamos a repartir del muro ubicado frente al asiento "
				},
			"third": {
				"en": " from the ",
				"es": " desde la "
				},			
			"fourth": {
				"en": " tile of selected wall. ",
				"es": " ficha de dicho muro. "
				}
			}
		},
	"Contact": {
		"title": {
			"en":"Contact us",
			"es":"Contáctanos"
			},
		"descriptionLittle": {
			"en": "Thanks for reaching here! We hope you are enjoying and learning how to play Mahjong Riichi as much as we do making this tutorial.. As you may noticed, this site is under development and some features could appear unfinished or wrong, so feel free to contact us to point out this issues, recommending some improvements that you'd like, or simply just say Hi, through GitHub or the contact form below.. Have a nice day!",
			"es": "¡Gracias por llegar hasta aquí! Esperamos que estés disfrutando y aprendiendo cómo jugar Mahjong Riichi tanto como nosotros haciendo este tutorial.. Como puedes haberte dado cuenta, este sitio continúa en desarrollo y algunas características pueden parecer incompletas o incorrectas, siéntete libre de contactarnos para indicarnos estos errores, recomendar alguna mejora que quisieras, o simplemente saludarnos, a través de GitHub o el formulario de contacto más abajo.. ¡Que tengas un buen día!"
			},
		"otherContactMethods": [
			{ "en": "enanox in GitHub", "es": "enanox en GitHub", "link": "http://github.com/enanox", "icon": "repo-github"},
			{ "en": "Raise an issue", "es": "Subir una incidencia", "link": "http://github.com/enanox/mahjong-learn/issues", "icon": "issue-github"},
			{ "en": "Pull request", "es": "Peticiones pull", "link": "http://github.com/enanox/mahjong-learn/pulls", "icon": "pull-request"}
			],
		"form": {
			"name": {
				"en": "Name",
				"es": "Nombre",
				"error": {
					"required": { "en": "Your name is required.", "es": "Tu nombre es obligatorio."},
					"minlength": { "en": "Your name must be greater than 2 characters long.", "es": "Tu nombre debe tener más de 2 caracteres."}
					}
				},
			"email": {
				"en": "e-Mail",
				"es": "e-Mail",
				"error": {
					"required": { "en": "Your e-mail is required.", "es": "Tu e-mail es obligatorio."},
					"email": { "en": "Wrong e-mail format.", "es": "Formato de e-mail incorrecto."}
					}
				},
			"subject": {
				"en": "Subject",
				"es": "Asunto",
				"error": {
					"required": { "en": "The subject is required.", "es": "El asunto es obligatorio."},
					"minlength": { "en": "The subject must be greater than 3 characters long", "es": "El asunto debe tener más de 3 caracteres."}
					}
				},
			"message": {
				"en": "Message",
				"es": "Comentario"
				},
			"send": {
				"en": "Send",
				"es": "Enviar"
				},
			"reset": {
				"en": "Reset",
				"es": "Borrar"
				}
			}
		}
	}
}
